import pickle
import numpy as np
import pandas as pd
import nltk

path = "med_inds_clustering/"
ind_file = path+"june_inds_all.pkl"

pkl_file = open(ind_file, "rb")
inds = pickle.load(pkl_file)
pkl_file.close()

med_keywords = [
    ["медицина_NOUN", "смертность_NOUN", "врач_NOUN", "туберкулез_NOUN", "здравоохранение_NOUN", "здоровье_NOUN", 
     "заболеваемость_NOUN", "больной_NOUN", "фармацевтический_ADJ", "болезнь_NOUN", "рождение_NOUN", "вич_ADJ", 
     "злокачественный_ADJ", "кровообращение_NOUN", "инфекция_NOUN", "заболевание_NOUN", "наркомания_NOUN", 
     "реабилитация_NOUN", "больной_ADJ", "материнский_ADJ", "койка_NOUN", "лекарство_NOUN", "диспансеризация_NOUN", 
     "диагноз_NOUN", "лечение_NOUN", "инфицирование_NOUN", "пациент_NOUN", "диспансерный_ADJ", "беременность_NOUN", 
     "лечебный_ADJ", "ремиссия_NOUN", "иммунизация_NOUN", "алкоголизм_NOUN", "акушер_NOUN", "паллиативный_ADJ", 
     "кровь_NOUN", "наркологический_ADJ", "психотропный_ADJ", "вирус_NOUN", "госпитализировать_VERB", "фельдшер_NOUN", 
     "энцефалит_NOUN", "врачебный_ADJ", "рождаемость_NOUN", "донор_NOUN", "гепатит_NOUN", "диабет_NOUN", "прививка_NOUN", 
     "антинаркотический_ADJ", "умерший_NOUN", "поликлинический_ADJ", "амбулаторно_ADV", "терапия_NOUN", "зубной_ADJ", 
     "амбулатория_NOUN", "протез_NOUN","больничный_ADJ", "психоактивный_ADJ", "краснуха_NOUN", "неонатальный_ADJ", 
     "вакцинация_NOUN", "онкологический_ADJ", "дифтерия_NOUN", "антиретровирусный_ADJ", "эпидемический_ADJ", 
     "паротит_NOUN", "расстройство_NOUN", "новорожденный_NOUN", "смерть_NOUN", "зож_NOUN", "грипп_NOUN", "ожирение_NOUN", 
     "химиопрофилактика_NOUN", "вакцина_NOUN", "психический_ADJ", "медико-санитарный_ADJ", "синдром_NOUN", 
     "терапевтический_ADJ", "курящий_ADJ", "бактериовыделение_NOUN", "сердечно_ADV", "лимфоидный_ADJ", "коклюш_NOUN", 
     "пренатальный_ADJ", "гемофилия_NOUN", "зубопротезирование_NOUN", "кроветворный_ADJ", "трансплантация_NOUN", 
     "триместр_NOUN", "выживаемость_NOUN", "имплантат_NOUN", "травматизм_NOUN", "склероз_NOUN", "иммунопрофилактика_NOUN", 
     "гипофизарный_ADJ", "мозг_NOUN", "столбняк_NOUN", "больница_NOUN", "пролечивать_VERB", "патология_NOUN", "травма_NOUN", 
     "диспансер_NOUN", "наркосодержащий_ADJ", "табакокурение_NOUN", "поликлиника_NOUN", "гемодиализ_NOUN", 
     "таблетировать_VERB", "привитость_NOUN", "спид_NOUN", "иммунодепрессант_NOUN", "сердце_NOUN", "медосмотр_NOUN", 
     "хронический_ADJ", "инсульт_NOUN", "медперсонал_NOUN", "рожать_VERB", "холестерин_NOUN", "сифилис_NOUN", 
     "сильнодействующий_ADJ", "головной_ADJ", "противотуберкулезный_ADJ", "аборт_NOUN", "наркоконтроль_NOUN", 
     "опьянение_NOUN", "гипертензия_NOUN", "роженица_NOUN", "иммуноглобулин_NOUN", "неинфекционный_ADJ", 
     "флюорографический_ADJ", "электрокардиограф_NOUN", "реаниматолог_NOUN", "госпитализация_NOUN", "анестезиолог_NOUN", 
     "психиатрический_ADJ", "астма_NOUN", "иммунодефицит_NOUN", "бронхиальный_ADJ", "койкодень_NOUN", "родильница_NOUN", 
     "перинатальный_ADJ", "курение_NOUN", "наркозависимый_ADJ", "предписание_NOUN", "психологический_ADJ", "матка_NOUN", 
     "туберкулин_NOUN", "дизентерия_NOUN", "госпитальный_ADJ", "гипертония_NOUN", "миокард_NOUN", "офтальмолог_NOUN", 
     "йоддефицитный_ADJ", "лейкоз_NOUN", "опухоль_NOUN", "инфаркт_NOUN", "травмирование_NOUN", "клинический_ADJ", 
     "рак_NOUN", "инфекционист_NOUN", "болезненность_NOUN", "антиалкогольный_ADJ", "прививать_VERB", "физиотерапия_NOUN", 
     "диетологический_ADJ", "рецидивный_ADJ", "донорство_NOUN", "почка_NOUN", "наркология_NOUN", "бациллярность_NOUN", 
     "санировать_VERB", "вспышка_NOUN", "коронарный_ADJ", "аптечный_ADJ", "медработник_NOUN", "нарколог_NOUN", 
     "медикосоциальный_ADJ", "гонорея_NOUN", "тромбоцит_NOUN", "здоровьесбережение_NOUN", "безрецидивный_ADJ", 
     "стоматолог_NOUN", "лимфобластной_ADJ", "интерн_NOUN", "роды_NOUN", "лимфоцит_NOUN", "травмировать_VERB", 
     "наркопотребитель_NOUN", "тромболизис_NOUN", "тиф_NOUN", "онкология_NOUN", "медпрофилактика_NOUN", "заболевать_VERB", 
     "эпидемиология_NOUN", "тромболитический_ADJ", "противоопухолевый_ADJ", "лечащий_ADJ", "полиомиелит_NOUN", 
     "иммунитет_NOUN", "геморрагический_ADJ", "оспа_NOUN", "туберкулинодиагностический_ADJ", "бесплодие_NOUN", 
     "иммунобиологический_ADJ", "оплодотворение_NOUN", "лечебница_NOUN", "онкозаболевание_NOUN", "вакцинопрофилактика_NOUN", 
     "жизнеобеспечение_NOUN", "психиатр_NOUN", "психоневрологический_ADJ", "пищеварение_NOUN", "минздравсоцразвитие_NOUN", 
     "фельшерскоакушерский_ADJ", "психоз_NOUN", "ординатор_NOUN", "лимфома_NOUN", "иммунный_ADJ", "алкоголик_NOUN", 
     "профилакторий_NOUN", "онкопатология_NOUN", "маммографический_ADJ"], 
    ["уровень_NOUN жизнь_NOUN", "страхование_NOUN жизнь_NOUN"]]
#'аборт_NOUN', 'розничный_ADJ'
med_output = []

for ind in inds:
    if len(ind[2]) > 0:
        bigrm = list(nltk.bigrams(ind[2]))
        bigrm = [" ".join(b) for b in bigrm]
        if ( any(word in ind[2] for word in med_keywords[0])
            or any(b in bigrm for b in med_keywords[1]) 
            ):
            med_output.append(ind)

output = open(path+"june_inds_med_by_kw.pkl", "wb")
pickle.dump(med_output, output)
output.close()
    
df = pd.DataFrame(med_output)
df.to_csv(path+"june_inds_med_by_kw.csv", index=False, header=True, encoding = "utf-8")    

